[
  {
    "id": "wayfair",
    "title": "Software Engineering Intern",
    "subtitle": "Wayfair, Boston MA, Jun - Aug 2018",
    "description": "I worked with Wayfair's Delivery Experience team to build out features of their site that improve customer experience, and gained experience with full-stack software development using PHP, SQL Server, and React.",
    "image": "/assets/experience/wayfair/wayfair.png",
    "image-shadow": true,
    "details": [
      {
        "type": "text",
        "content": "While working on Wayfair I was able to contribute to x. I completed two projects, the first was to extend the functionality of Wayfair's SMS platform to allow customers to unsubscribe from categories of SMS messages, allowing them to tailer their experience to their liking."
      },
      {
        "type": "text",
        "content": "My second project was to develop a proof of concept for a system to generate intelligent responses to incoming customer text messages using Dialogflow."
      }
    ]
  },
  {
    "id": "dropwise",
    "title": "Developer",
    "subtitle": "Dropwise Inc, Worcester MA, Nov 2016 - present",
    "description": "I joined WPI startup Dropwise to learn React Native mobile app development and create apps that help students. We launched our first app <a href=\"http://woodeals.app/\" target=\"_blank\">WooDeals</a> in August 2018.",
    "image": "/assets/experience/dropwise/dropwise.png",
    "image-shadow": true
  },
  {
    "id": "jekylldev",
    "title": "Website Developer",
    "subtitle": "WPI Computer Science Department, Dec 2017 - Mar 2018",
    "description": "I developed <a href=\"https://cs582-18s.github.io/\" target=\"_blank\">class</a> and <a href=\"https://wpivis.github.io/\" target=\"_blank\">lab</a> websites for a WPI professor, and helped set up course infrastructure. I gained experience using Jekyll, GitHub Pages, and JavaScript libraries including Moment.js, Tipue Search, and Inquirer.js.",
    "image": "/assets/experience/jekylldev/view-lab-logo.png",
    "image-shadow": true
  },
  {
    "id": "wpi",
    "title": "Student",
    "subtitle": "Worcester Polytechnic Institute, Aug 2015 - present",
    "description": "I am pursuing a bachelor's degree in Computer Science, at a school that masterfully balances the teaching of theory and practice. Many of my courses are centered around hands-on projects and groupwork that promote independent learning and collaboration.",
    "image": "/assets/experience/wpi/wpi.png",
  }
]
